Revit 2026 API

# ParameterTypeIdEnergyAnalysisBuildingOperatingSchedule Property

---

"Building Operating Schedule"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisBuildingOperatingSchedule As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisBuildingOperatingSchedule {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisBuildingOperatingSchedule : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace